RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2_private.h
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 */

/**
 * @file drv_adc_v2_private.h
 * @brief Private declarations for the STM32 ADC V2 backend.
 */

#ifndef __DRV_ADC_V2_PRIVATE_H__
#define __DRV_ADC_V2_PRIVATE_H__

#include <rtconfig.h>

#if defined(RT_USING_ADC_V2)

#include "drv_adc_v2.h"
#include <stddef.h>

#if defined(BSP_USING_ADC1) || defined(BSP_USING_ADC2) || defined(BSP_USING_ADC3) || defined(BSP_USING_ADC4)

/* STM32 HAL ADC support is detected here when the HAL exposes a stable
 * feature macro. Keep series-specific defaults and internal-channel routing
 * overrides in config/<series>/adc_config_v2.h; keep HAL structure/API
 * compatibility here so new series normally inherit support from their HAL
 * headers.
 */

/* STM32F0-like sequencers use ADC_RANK_CHANNEL_NUMBER instead of a numeric
 * regular-rank slot. Other HALs that expose ADC_REGULAR_RANK_x constants can
 * use those constants directly; otherwise plain rank numbers are used.
 */
#if defined(ADC_RANK_CHANNEL_NUMBER)
#define STM32_ADC_HAS_CHANNEL_NUMBER_RANK 1
#elif defined(ADC_REGULAR_RANK_1)
#define STM32_ADC_HAS_ENUM_RANK 1
#endif /* defined(ADC_RANK_CHANNEL_NUMBER) */

#if defined(ADC_CONVERSIONDATA_DR) && defined(ADC_CONVERSIONDATA_DMA_CIRCULAR)
#define STM32_ADC_HAS_INIT_CONVERSION_DATA_MANAGEMENT 1
#endif /* defined(ADC_CONVERSIONDATA_DR) && defined(ADC_CONVERSIONDATA_DMA_CIRCULAR) */

#if defined(ADC_SCAN_ENABLE)
#define STM32_ADC_SCAN_MODE_ENABLE ADC_SCAN_ENABLE
#elif defined(ADC_SCAN_DIRECTION_FORWARD)
#define STM32_ADC_SCAN_MODE_ENABLE ADC_SCAN_DIRECTION_FORWARD
#else
#define STM32_ADC_SCAN_MODE_ENABLE ENABLE
#endif /* defined(ADC_SCAN_ENABLE) */

#if defined(ADC_SCAN_DISABLE)
#define STM32_ADC_SCAN_MODE_DISABLE ADC_SCAN_DISABLE
#elif defined(ADC_SCAN_DIRECTION_FORWARD)
#define STM32_ADC_SCAN_MODE_DISABLE ADC_SCAN_DIRECTION_FORWARD
#else
#define STM32_ADC_SCAN_MODE_DISABLE DISABLE
#endif /* defined(ADC_SCAN_DISABLE) */

/* Channel configuration fields are tied to HAL channel-mode and offset macros.
 * A config file may still override these before including this driver header if
 * a vendor HAL variant exposes a different field layout.
 */
#if !defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS)
#if defined(ADC_SINGLE_ENDED) && defined(ADC_DIFFERENTIAL_ENDED)
#define STM32_ADC_HAS_SINGLE_DIFF_FIELDS 1
#define STM32_ADC_SINGLE_ENDED_VALUE     ADC_SINGLE_ENDED
#define STM32_ADC_DIFFERENTIAL_VALUE     ADC_DIFFERENTIAL_ENDED
#elif defined(LL_ADC_SINGLE_ENDED) && defined(LL_ADC_DIFFERENTIAL_ENDED)
#define STM32_ADC_HAS_SINGLE_DIFF_FIELDS 1
#define STM32_ADC_SINGLE_ENDED_VALUE     LL_ADC_SINGLE_ENDED
#define STM32_ADC_DIFFERENTIAL_VALUE     LL_ADC_DIFFERENTIAL_ENDED
#endif /* defined(ADC_SINGLE_ENDED) && defined(ADC_DIFFERENTIAL_ENDED) */
#endif /* !defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS) */

#if defined(ADC_OFFSET_NONE)
#ifndef STM32_ADC_HAS_CONFIG_OFFSET
#define STM32_ADC_HAS_CONFIG_OFFSET 1
#endif /* STM32_ADC_HAS_CONFIG_OFFSET */
#ifndef STM32_ADC_HAS_CONFIG_OFFSET_NUMBER
#define STM32_ADC_HAS_CONFIG_OFFSET_NUMBER 1
#endif /* STM32_ADC_HAS_CONFIG_OFFSET_NUMBER */
#endif /* defined(ADC_OFFSET_NONE) */

#if defined(ADC_RESOLUTION_12B)
#define STM32_ADC_HAS_CONFIGURABLE_RESOLUTION 1
#endif /* defined(ADC_RESOLUTION_12B) */

#if defined(ADC_CALIB_OFFSET_LINEARITY)
#define STM32_ADC_HAS_LINEAR_CALIBRATION 1
#endif /* defined(ADC_CALIB_OFFSET_LINEARITY) */

#if defined(STM32_ADC_HAS_SIMPLE_CALIBRATION) || defined(STM32_ADC_HAS_LINEAR_CALIBRATION)
#define STM32_ADC_HAS_CALIBRATION 1
#endif /* defined(STM32_ADC_HAS_SIMPLE_CALIBRATION) || defined(STM32_ADC_HAS_LINEAR_CALIBRATION) */

#if defined(__LL_ADC_CALC_VREFANALOG_VOLTAGE) && defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION)
#define STM32_ADC_HAS_LL_VREF_CALC 1
#endif /* defined(__LL_ADC_CALC_VREFANALOG_VOLTAGE) && defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION) */

#if defined(STM32_ADC_HAS_LL_VREF_CALC)
#if defined(STM32_ADC_VREF_NEEDS_INSTANCE)
/* Calculate VDDA in millivolts with an instance-aware LL helper. */
#define STM32_ADC_CALC_VREF_MV(_adc, _raw) \
    __LL_ADC_CALC_VREFANALOG_VOLTAGE((_adc)->handle.Instance, (_raw), (_adc)->handle.Init.Resolution)
#else
/* Calculate VDDA in millivolts with the generic LL helper. */
#define STM32_ADC_CALC_VREF_MV(_adc, _raw) \
    __LL_ADC_CALC_VREFANALOG_VOLTAGE((_raw), (_adc)->handle.Init.Resolution)
#endif /* defined(STM32_ADC_VREF_NEEDS_INSTANCE) */
#endif /* defined(STM32_ADC_HAS_LL_VREF_CALC) */

#if defined(__LL_ADC_CALC_TEMPERATURE) && defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION)
#define STM32_ADC_HAS_LL_TEMPERATURE_CALC 1

#if defined(STM32_ADC_TEMPERATURE_NEEDS_INSTANCE)
/* Calculate temperature in degrees Celsius with an instance-aware LL helper. */
#define STM32_ADC_CALC_TEMPERATURE(_adc, _vref_mv, _raw, _resolution) \
    __LL_ADC_CALC_TEMPERATURE((_adc)->handle.Instance, (_vref_mv), (_raw), (_resolution))
#else
/* Calculate temperature in degrees Celsius with the generic LL helper. */
#define STM32_ADC_CALC_TEMPERATURE(_adc, _vref_mv, _raw, _resolution) \
    __LL_ADC_CALC_TEMPERATURE((_vref_mv), (_raw), (_resolution))
#endif /* defined(STM32_ADC_TEMPERATURE_NEEDS_INSTANCE) */

#endif /* defined(__LL_ADC_CALC_TEMPERATURE) && defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION) */

#if defined(TEMPSENSOR_CAL1_ADDR) && defined(TEMPSENSOR_CAL2_ADDR) && defined(TEMPSENSOR_CAL1_TEMP) && \
    defined(TEMPSENSOR_CAL2_TEMP) && defined(TEMPSENSOR_CAL_VREFANALOG)
#define STM32_ADC_HAS_TEMPSENSOR_CALIBRATION_DATA 1
#endif /* defined(TEMPSENSOR_CAL1_ADDR) && defined(TEMPSENSOR_CAL2_ADDR) && defined(TEMPSENSOR_CAL1_TEMP) && defined(TEMPSENSOR_CAL2_TEMP) && defined(TEMPSENSOR_CAL_VREFANALOG) */

#if defined(ADC_OVERSAMPLING_RATIO_2) && defined(ADC_RIGHTBITSHIFT_1)
#if defined(ADC_TRIGGEREDMODE_SINGLE_TRIGGER) && defined(ADC_REGOVERSAMPLING_CONTINUED_MODE)
#define STM32_ADC_HAS_HW_OVERSAMPLING 1
#endif /* defined(ADC_TRIGGEREDMODE_SINGLE_TRIGGER) && defined(ADC_REGOVERSAMPLING_CONTINUED_MODE) */
#endif /* defined(ADC_OVERSAMPLING_RATIO_2) && defined(ADC_RIGHTBITSHIFT_1) */

