RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2_private.h
/** @brief Marker for an unavailable STM32 HAL ADC channel. */
#ifndef STM32_ADC_INVALID_CHANNEL
#define STM32_ADC_INVALID_CHANNEL 0xFFFFFFFFUL
#endif /* STM32_ADC_INVALID_CHANNEL */

/** @brief Invalid RT-Thread logical ADC channel marker. */
#ifndef STM32_ADC_INVALID_LOGICAL_CHANNEL
#define STM32_ADC_INVALID_LOGICAL_CHANNEL (-1)
#endif /* STM32_ADC_INVALID_LOGICAL_CHANNEL */

/** @brief STM32 ADC instance mask bit for ADC1. */
#ifndef STM32_ADC_INSTANCE_MASK_ADC1
#define STM32_ADC_INSTANCE_MASK_ADC1 (1UL << 0)
#endif /* STM32_ADC_INSTANCE_MASK_ADC1 */

/** @brief STM32 ADC instance mask bit for ADC2. */
#ifndef STM32_ADC_INSTANCE_MASK_ADC2
#define STM32_ADC_INSTANCE_MASK_ADC2 (1UL << 1)
#endif /* STM32_ADC_INSTANCE_MASK_ADC2 */

/** @brief STM32 ADC instance mask bit for ADC3. */
#ifndef STM32_ADC_INSTANCE_MASK_ADC3
#define STM32_ADC_INSTANCE_MASK_ADC3 (1UL << 2)
#endif /* STM32_ADC_INSTANCE_MASK_ADC3 */

/** @brief STM32 ADC instance mask bit for ADC4. */
#ifndef STM32_ADC_INSTANCE_MASK_ADC4
#define STM32_ADC_INSTANCE_MASK_ADC4 (1UL << 3)
#endif /* STM32_ADC_INSTANCE_MASK_ADC4 */

/** @brief STM32 ADC instance mask bit for ADC5. */
#ifndef STM32_ADC_INSTANCE_MASK_ADC5
#define STM32_ADC_INSTANCE_MASK_ADC5 (1UL << 4)
#endif /* STM32_ADC_INSTANCE_MASK_ADC5 */

/** @brief Convert a STM32 HAL ADC channel literal into a RT-Thread logical channel number. */
#ifndef STM32_ADC_HAL_CHANNEL_TO_LOGICAL
#if defined(__HAL_ADC_CHANNEL_TO_DECIMAL_NB)
#define STM32_ADC_HAL_CHANNEL_TO_LOGICAL(_channel) __HAL_ADC_CHANNEL_TO_DECIMAL_NB(_channel)
#elif defined(__LL_ADC_CHANNEL_TO_DECIMAL_NB)
#define STM32_ADC_HAL_CHANNEL_TO_LOGICAL(_channel) __LL_ADC_CHANNEL_TO_DECIMAL_NB(_channel)
#else
#define STM32_ADC_HAL_CHANNEL_TO_LOGICAL(_channel) STM32_ADC_INVALID_LOGICAL_CHANNEL
#endif /* defined(__HAL_ADC_CHANNEL_TO_DECIMAL_NB) */
#endif /* STM32_ADC_HAL_CHANNEL_TO_LOGICAL */

/** @brief Maximum HAL ADC channel-table entries exposed by the active STM32 HAL. */
#ifndef STM32_ADC_MAX_CHANNELS
#if defined(ADC_CHANNEL_31)
#define STM32_ADC_MAX_CHANNELS 32
#elif defined(ADC_CHANNEL_30)
#define STM32_ADC_MAX_CHANNELS 31
#elif defined(ADC_CHANNEL_29)
#define STM32_ADC_MAX_CHANNELS 30
#elif defined(ADC_CHANNEL_28)
#define STM32_ADC_MAX_CHANNELS 29
#elif defined(ADC_CHANNEL_27)
#define STM32_ADC_MAX_CHANNELS 28
#elif defined(ADC_CHANNEL_26)
#define STM32_ADC_MAX_CHANNELS 27
#elif defined(ADC_CHANNEL_25)
#define STM32_ADC_MAX_CHANNELS 26
#elif defined(ADC_CHANNEL_24)
#define STM32_ADC_MAX_CHANNELS 25
#elif defined(ADC_CHANNEL_23)
#define STM32_ADC_MAX_CHANNELS 24
#elif defined(ADC_CHANNEL_22)
#define STM32_ADC_MAX_CHANNELS 23
#elif defined(ADC_CHANNEL_21)
#define STM32_ADC_MAX_CHANNELS 22
#elif defined(ADC_CHANNEL_20)
#define STM32_ADC_MAX_CHANNELS 21
#elif defined(ADC_CHANNEL_19)
#define STM32_ADC_MAX_CHANNELS 20
#elif defined(ADC_CHANNEL_18)
#define STM32_ADC_MAX_CHANNELS 19
#elif defined(ADC_CHANNEL_17)
#define STM32_ADC_MAX_CHANNELS 18
#elif defined(ADC_CHANNEL_16)
#define STM32_ADC_MAX_CHANNELS 17
#else
#define STM32_ADC_MAX_CHANNELS 16
#endif /* defined(ADC_CHANNEL_31) */
#endif /* STM32_ADC_MAX_CHANNELS */

/* Optional ADC channel encodings supplied by the active STM32 HAL. */
#ifndef STM32_ADC_CHANNEL_16
#ifdef ADC_CHANNEL_16
#define STM32_ADC_CHANNEL_16 ADC_CHANNEL_16
#else
#define STM32_ADC_CHANNEL_16 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_16 */
#endif /* STM32_ADC_CHANNEL_16 */

#ifndef STM32_ADC_CHANNEL_17
#ifdef ADC_CHANNEL_17
#define STM32_ADC_CHANNEL_17 ADC_CHANNEL_17
#else
#define STM32_ADC_CHANNEL_17 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_17 */
#endif /* STM32_ADC_CHANNEL_17 */

#ifndef STM32_ADC_CHANNEL_18
#ifdef ADC_CHANNEL_18
#define STM32_ADC_CHANNEL_18 ADC_CHANNEL_18
#else
#define STM32_ADC_CHANNEL_18 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_18 */
#endif /* STM32_ADC_CHANNEL_18 */

#ifndef STM32_ADC_CHANNEL_19
#ifdef ADC_CHANNEL_19
#define STM32_ADC_CHANNEL_19 ADC_CHANNEL_19
#else
#define STM32_ADC_CHANNEL_19 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_19 */
#endif /* STM32_ADC_CHANNEL_19 */

#ifndef STM32_ADC_CHANNEL_20
#ifdef ADC_CHANNEL_20
#define STM32_ADC_CHANNEL_20 ADC_CHANNEL_20
#else
#define STM32_ADC_CHANNEL_20 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_20 */
#endif /* STM32_ADC_CHANNEL_20 */

#ifndef STM32_ADC_CHANNEL_21
#ifdef ADC_CHANNEL_21
#define STM32_ADC_CHANNEL_21 ADC_CHANNEL_21
#else
#define STM32_ADC_CHANNEL_21 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_21 */
#endif /* STM32_ADC_CHANNEL_21 */

#ifndef STM32_ADC_CHANNEL_22
#ifdef ADC_CHANNEL_22
#define STM32_ADC_CHANNEL_22 ADC_CHANNEL_22
#else
#define STM32_ADC_CHANNEL_22 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_22 */
#endif /* STM32_ADC_CHANNEL_22 */

#ifndef STM32_ADC_CHANNEL_23
#ifdef ADC_CHANNEL_23
#define STM32_ADC_CHANNEL_23 ADC_CHANNEL_23
#else
#define STM32_ADC_CHANNEL_23 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_23 */
#endif /* STM32_ADC_CHANNEL_23 */

#ifndef STM32_ADC_CHANNEL_24
#ifdef ADC_CHANNEL_24
#define STM32_ADC_CHANNEL_24 ADC_CHANNEL_24
#else
#define STM32_ADC_CHANNEL_24 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_24 */
#endif /* STM32_ADC_CHANNEL_24 */

#ifndef STM32_ADC_CHANNEL_25
#ifdef ADC_CHANNEL_25
#define STM32_ADC_CHANNEL_25 ADC_CHANNEL_25
#else
#define STM32_ADC_CHANNEL_25 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_25 */
#endif /* STM32_ADC_CHANNEL_25 */

#ifndef STM32_ADC_CHANNEL_26
#ifdef ADC_CHANNEL_26
#define STM32_ADC_CHANNEL_26 ADC_CHANNEL_26
#else
#define STM32_ADC_CHANNEL_26 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_26 */
#endif /* STM32_ADC_CHANNEL_26 */

#ifndef STM32_ADC_CHANNEL_27
#ifdef ADC_CHANNEL_27
#define STM32_ADC_CHANNEL_27 ADC_CHANNEL_27
#else
#define STM32_ADC_CHANNEL_27 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_27 */
#endif /* STM32_ADC_CHANNEL_27 */

#ifndef STM32_ADC_CHANNEL_28
#ifdef ADC_CHANNEL_28
#define STM32_ADC_CHANNEL_28 ADC_CHANNEL_28
#else
#define STM32_ADC_CHANNEL_28 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_28 */
#endif /* STM32_ADC_CHANNEL_28 */

#ifndef STM32_ADC_CHANNEL_29
#ifdef ADC_CHANNEL_29
#define STM32_ADC_CHANNEL_29 ADC_CHANNEL_29
#else
#define STM32_ADC_CHANNEL_29 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_29 */
#endif /* STM32_ADC_CHANNEL_29 */

#ifndef STM32_ADC_CHANNEL_30
#ifdef ADC_CHANNEL_30
#define STM32_ADC_CHANNEL_30 ADC_CHANNEL_30
#else
#define STM32_ADC_CHANNEL_30 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_30 */
#endif /* STM32_ADC_CHANNEL_30 */

