RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2_private.h
#ifndef STM32_ADC_CHANNEL_31
#ifdef ADC_CHANNEL_31
#define STM32_ADC_CHANNEL_31 ADC_CHANNEL_31
#else
#define STM32_ADC_CHANNEL_31 STM32_ADC_INVALID_CHANNEL
#endif /* ADC_CHANNEL_31 */
#endif /* STM32_ADC_CHANNEL_31 */

/**
 * @brief Default ADC instance mask for common STM32 internal ADC sources.
 *
 * Series configuration files should override this macro only when internal
 * sources are not routed to ADC1 by default.
 */
#ifndef STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#define STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC1
#endif /* STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK */

/* Resolve temperature sensor HAL channel and supported ADC instances. */
#ifndef STM32_ADC_TEMP_HAL_CHANNEL
#if defined(ADC_CHANNEL_TEMPSENSOR_ADC1)
#define STM32_ADC_TEMP_HAL_CHANNEL ADC_CHANNEL_TEMPSENSOR_ADC1
#ifndef STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_TEMP_INSTANCE_MASK
#define STM32_ADC_TEMP_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC1
#endif /* STM32_ADC_TEMP_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_TEMPSENSOR_ADC3)
#define STM32_ADC_TEMP_HAL_CHANNEL ADC_CHANNEL_TEMPSENSOR_ADC3
#ifndef STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_TEMP_INSTANCE_MASK
#define STM32_ADC_TEMP_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC3
#endif /* STM32_ADC_TEMP_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_TEMPSENSOR)
#define STM32_ADC_TEMP_HAL_CHANNEL ADC_CHANNEL_TEMPSENSOR
#ifndef STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_TEMP_INSTANCE_MASK
#define STM32_ADC_TEMP_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#endif /* STM32_ADC_TEMP_INSTANCE_MASK */
#else
#define STM32_ADC_TEMP_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#ifndef STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL_AVAILABLE 0
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_TEMP_INSTANCE_MASK
#define STM32_ADC_TEMP_INSTANCE_MASK 0UL
#endif /* STM32_ADC_TEMP_INSTANCE_MASK */
#endif /* defined(ADC_CHANNEL_TEMPSENSOR_ADC1) */
#endif /* STM32_ADC_TEMP_HAL_CHANNEL */

/** @brief Whether the primary temperature-sensor HAL channel can be used. */
#ifndef STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */

#ifndef STM32_ADC_TEMP_INSTANCE_MASK
#if STM32_ADC_TEMP_CHANNEL_AVAILABLE
/** @brief ADC instances that can sample the temperature sensor. */
#define STM32_ADC_TEMP_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#else
/** @brief ADC instances that can sample the temperature sensor. */
#define STM32_ADC_TEMP_INSTANCE_MASK 0UL
#endif /* STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_TEMP_INSTANCE_MASK */

#ifndef STM32_ADC_TEMP_CHANNEL
#if !STM32_ADC_TEMP_CHANNEL_AVAILABLE
#define STM32_ADC_TEMP_CHANNEL STM32_ADC_INVALID_LOGICAL_CHANNEL
#elif defined(STM32_ADC_TEMP_LOGICAL_OVERRIDE)
#define STM32_ADC_TEMP_CHANNEL STM32_ADC_TEMP_LOGICAL_OVERRIDE
#elif defined(__HAL_ADC_CHANNEL_TO_DECIMAL_NB) || defined(__LL_ADC_CHANNEL_TO_DECIMAL_NB)
#define STM32_ADC_TEMP_CHANNEL STM32_ADC_HAL_CHANNEL_TO_LOGICAL(STM32_ADC_TEMP_HAL_CHANNEL)
#else
#error "STM32 ADC V2: define STM32_ADC_TEMP_LOGICAL_OVERRIDE for this legacy HAL series."
#endif /* !STM32_ADC_TEMP_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_TEMP_CHANNEL */

/* Resolve VBAT HAL channel and supported ADC instances. */
#ifndef STM32_ADC_VBAT_HAL_CHANNEL
#if defined(ADC_CHANNEL_VBAT_ADC1)
#define STM32_ADC_VBAT_HAL_CHANNEL ADC_CHANNEL_VBAT_ADC1
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#define STM32_ADC_VBAT_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC1
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VBAT_ADC2)
#define STM32_ADC_VBAT_HAL_CHANNEL ADC_CHANNEL_VBAT_ADC2
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#define STM32_ADC_VBAT_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC2
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VBAT_ADC3)
#define STM32_ADC_VBAT_HAL_CHANNEL ADC_CHANNEL_VBAT_ADC3
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#define STM32_ADC_VBAT_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC3
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VBAT)
#define STM32_ADC_VBAT_HAL_CHANNEL ADC_CHANNEL_VBAT
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#define STM32_ADC_VBAT_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */
#else
#define STM32_ADC_VBAT_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 0
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#define STM32_ADC_VBAT_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */
#endif /* defined(ADC_CHANNEL_VBAT_ADC1) */
#endif /* STM32_ADC_VBAT_HAL_CHANNEL */

/** @brief Whether the primary VBAT HAL channel can be used. */
#ifndef STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */

#ifndef STM32_ADC_VBAT_INSTANCE_MASK
#if STM32_ADC_VBAT_CHANNEL_AVAILABLE
/** @brief ADC instances that can sample VBAT. */
#define STM32_ADC_VBAT_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#else
/** @brief ADC instances that can sample VBAT. */
#define STM32_ADC_VBAT_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_VBAT_INSTANCE_MASK */

#ifndef STM32_ADC_VBAT_CHANNEL
#if !STM32_ADC_VBAT_CHANNEL_AVAILABLE
#define STM32_ADC_VBAT_CHANNEL STM32_ADC_INVALID_LOGICAL_CHANNEL
#elif defined(STM32_ADC_VBAT_LOGICAL_OVERRIDE)
#define STM32_ADC_VBAT_CHANNEL STM32_ADC_VBAT_LOGICAL_OVERRIDE
#elif defined(__HAL_ADC_CHANNEL_TO_DECIMAL_NB) || defined(__LL_ADC_CHANNEL_TO_DECIMAL_NB)
#define STM32_ADC_VBAT_CHANNEL STM32_ADC_HAL_CHANNEL_TO_LOGICAL(STM32_ADC_VBAT_HAL_CHANNEL)
#else
#error "STM32 ADC V2: define STM32_ADC_VBAT_LOGICAL_OVERRIDE for this legacy HAL series."
#endif /* !STM32_ADC_VBAT_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_VBAT_CHANNEL */

/* Resolve VREFINT HAL channel and supported ADC instances. */
#ifndef STM32_ADC_VREF_HAL_CHANNEL
#if defined(ADC_CHANNEL_VREFINT_ADC1)
#define STM32_ADC_VREF_HAL_CHANNEL ADC_CHANNEL_VREFINT_ADC1
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VREF_INSTANCE_MASK
#define STM32_ADC_VREF_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC1
#endif /* STM32_ADC_VREF_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VREFINT_ADC2)
#define STM32_ADC_VREF_HAL_CHANNEL ADC_CHANNEL_VREFINT_ADC2
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VREF_INSTANCE_MASK
#define STM32_ADC_VREF_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC2
#endif /* STM32_ADC_VREF_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VREFINT_ADC3)
#define STM32_ADC_VREF_HAL_CHANNEL ADC_CHANNEL_VREFINT_ADC3
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VREF_INSTANCE_MASK
#define STM32_ADC_VREF_INSTANCE_MASK STM32_ADC_INSTANCE_MASK_ADC3
#endif /* STM32_ADC_VREF_INSTANCE_MASK */
#elif defined(ADC_CHANNEL_VREFINT)
#define STM32_ADC_VREF_HAL_CHANNEL ADC_CHANNEL_VREFINT
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VREF_INSTANCE_MASK
#define STM32_ADC_VREF_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#endif /* STM32_ADC_VREF_INSTANCE_MASK */
#else
#define STM32_ADC_VREF_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 0
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#ifndef STM32_ADC_VREF_INSTANCE_MASK
#define STM32_ADC_VREF_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VREF_INSTANCE_MASK */
#endif /* defined(ADC_CHANNEL_VREFINT_ADC1) */
#endif /* STM32_ADC_VREF_HAL_CHANNEL */

