RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2_private.h
/** @brief Whether the primary VREFINT HAL channel can be used. */
#ifndef STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL_AVAILABLE 1
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */

#ifndef STM32_ADC_VREF_INSTANCE_MASK
#if STM32_ADC_VREF_CHANNEL_AVAILABLE
/** @brief ADC instances that can sample VREFINT. */
#define STM32_ADC_VREF_INSTANCE_MASK STM32_ADC_INTERNAL_DEFAULT_INSTANCE_MASK
#else
/** @brief ADC instances that can sample VREFINT. */
#define STM32_ADC_VREF_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VREF_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_VREF_INSTANCE_MASK */

#ifndef STM32_ADC_VREF_CHANNEL
#if !STM32_ADC_VREF_CHANNEL_AVAILABLE
#define STM32_ADC_VREF_CHANNEL STM32_ADC_INVALID_LOGICAL_CHANNEL
#elif defined(STM32_ADC_VREF_LOGICAL_OVERRIDE)
#define STM32_ADC_VREF_CHANNEL STM32_ADC_VREF_LOGICAL_OVERRIDE
#elif defined(__HAL_ADC_CHANNEL_TO_DECIMAL_NB) || defined(__LL_ADC_CHANNEL_TO_DECIMAL_NB)
#define STM32_ADC_VREF_CHANNEL STM32_ADC_HAL_CHANNEL_TO_LOGICAL(STM32_ADC_VREF_HAL_CHANNEL)
#else
#error "STM32 ADC V2: define STM32_ADC_VREF_LOGICAL_OVERRIDE for this legacy HAL series."
#endif /* !STM32_ADC_VREF_CHANNEL_AVAILABLE */
#endif /* STM32_ADC_VREF_CHANNEL */

#ifndef STM32_ADC_TEMP_ALT_HAL_CHANNEL
#define STM32_ADC_TEMP_ALT_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#endif /* STM32_ADC_TEMP_ALT_HAL_CHANNEL */

#ifndef STM32_ADC_TEMP_ALT_INSTANCE_MASK
#define STM32_ADC_TEMP_ALT_INSTANCE_MASK 0UL
#endif /* STM32_ADC_TEMP_ALT_INSTANCE_MASK */

#ifndef STM32_ADC_VBAT_ALT_HAL_CHANNEL
#define STM32_ADC_VBAT_ALT_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#endif /* STM32_ADC_VBAT_ALT_HAL_CHANNEL */

#ifndef STM32_ADC_VBAT_ALT_INSTANCE_MASK
#define STM32_ADC_VBAT_ALT_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VBAT_ALT_INSTANCE_MASK */

#ifndef STM32_ADC_VREF_ALT_HAL_CHANNEL
#define STM32_ADC_VREF_ALT_HAL_CHANNEL STM32_ADC_INVALID_CHANNEL
#endif /* STM32_ADC_VREF_ALT_HAL_CHANNEL */

#ifndef STM32_ADC_VREF_ALT_INSTANCE_MASK
#define STM32_ADC_VREF_ALT_INSTANCE_MASK 0UL
#endif /* STM32_ADC_VREF_ALT_INSTANCE_MASK */

/**
 * @brief STM32 ADC device object.
 *
 * @note The HAL ADC handle must remain the first member. STM32 HAL
 *       callbacks receive an ADC_HandleTypeDef pointer, and this driver
 *       casts it back to struct stm32_adc while handling callbacks.
 */
struct stm32_adc
{
    ADC_HandleTypeDef handle;              /**< HAL ADC handle; keep first for HAL callback owner cast. */
    const char *name;                      /**< Device name. */
    struct stm32_adc_private_cfg config;   /**< Default STM32 backend private configuration. */
    struct rt_adc_device device;           /**< RT-Thread ADC device object. */
};

/*
 * HAL callbacks receive ADC_HandleTypeDef *. The driver casts it back to
 * struct stm32_adc, so the HAL handle must remain the first member.
 */
RT_STATIC_ASSERT(stm32_adc_handle_must_be_first, offsetof(struct stm32_adc, handle) == 0U);

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
 * @brief Check whether an ADC peripheral instance matches an instance mask.
 * @param instance ADC peripheral instance.
 * @param mask STM32_ADC_INSTANCE_MASK_x bit mask.
 * @return RT_TRUE if the instance is included, otherwise RT_FALSE.
 */
rt_bool_t stm32_adc_instance_match(ADC_TypeDef *instance, rt_uint32_t mask);

/**
 * @brief Get the HAL ADC channel identifier.
 * @param channel RT-Thread ADC channel identifier.
 * @param hal_channel Pointer to the output HAL ADC channel identifier.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_channel(rt_uint8_t channel, uint32_t *hal_channel);

/**
 * @brief Get the logical channel used to sample STM32 internal VREFINT.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical VREFINT channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_vref_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel);

/**
 * @brief Get the logical channel used to sample STM32 internal temperature sensor.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical temperature-sensor channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_tempsensor_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel);

/**
 * @brief Get the logical channel used to sample STM32 internal VBAT divider.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical VBAT channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_vbat_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel);

/**
 * @brief Get one HAL sampling-time value from STM32 private configuration.
 * @param cfg Pointer to the STM32 backend private configuration.
 * @param sampling_time Pointer to the output HAL sampling-time value.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_sampling_time(const struct stm32_adc_private_cfg *cfg, uint32_t *sampling_time);

/**
 * @brief Get the current ADC resolution in bits.
 * @param adc Pointer to the STM32 ADC device object.
 * @return Resolution in bits, or 12 when it cannot be determined.
 */
rt_uint8_t stm32_adc_get_resolution_bits(const struct stm32_adc *adc);

/**
 * @brief Calculate STM32 internal temperature sensor value in degrees Celsius.
 * @param device ADC device handle.
 * @param raw_value Raw ADC sample value from the temperature sensor channel.
 * @param vref_mv Current analog reference voltage in millivolts.
 * @param resolution_bits ADC conversion resolution used for @p raw_value.
 * @param temperature_c Pointer to the output temperature in degrees Celsius.
 * @return Operation status.
 */
rt_err_t stm32_adc_calc_temperature(rt_adc_device_t device, rt_uint32_t raw_value,
                                    rt_uint32_t vref_mv, rt_uint8_t resolution_bits,
                                    rt_int32_t *temperature_c);

/**
 * @brief Calculate VDDA from a raw VREFINT sample.
 * @param device Pointer to the ADC device object.
 * @param vref_mv Pointer to the raw VREFINT sample on input and VDDA millivolts on output.
 * @return Operation status.
 */
rt_err_t stm32_adc_calc_vref_mv(struct rt_adc_device *device, rt_uint32_t *vref_mv);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* defined(BSP_USING_ADC1) || defined(BSP_USING_ADC2) || defined(BSP_USING_ADC3) || defined(BSP_USING_ADC4) */

#endif /* defined(RT_USING_ADC_V2) */

#endif /* __DRV_ADC_V2_PRIVATE_H__ */
